use Деканат;
go

if object_id('Преподавание', 'U') is not null 
drop table Преподавание;
if object_id('Изучение', 'U') is not null 
drop table Изучение;
if object_id('Дисциплины', 'U') is not null 
drop table Дисциплины;
if object_id('Преподаватели', 'U') is not null 
drop table Преподаватели;
if object_id('Студенты', 'U') is not null 
drop table Студенты;
if object_id('Группы', 'U') is not null 
drop table Группы;
if object_id('Специальности', 'U') is not null 
drop table Специальности;
go

create table Специальности (
ID int primary key identity not null,
Шифр nvarchar(15) not null,
Наименование nvarchar(10) not null,
Форма_обучения nvarchar(7) not null,
Уровень_обучения nvarchar(12) not null,
Продолжительность_обучения int not null,
Описание nvarchar(50),
check (Форма_обучения in ('Очная', 'Заочная')),
check (Уровень_обучения in ('Бакалавриат', 'Специалитет','Магистратура','Аспирантура')),
);

create table Группы (
ID int primary key identity not null,
Название nvarchar(12) not null,
ID_Специальности int references Специальности(ID),
Староста int,
Куратор int 
);

create table Студенты (
Номер_зачётной_книжки int primary key identity not null,
Фамилия nvarchar(20) not null,
Имя nvarchar(20) not null,
Отчество nvarchar(20),
ID_Группы int references Группы(ID),
Год_поступления int not null,
);

create table Преподаватели (
Табельный_номер int primary key identity not null,
Фамилия nvarchar(20) not null,
Имя nvarchar(20) not null,
Отчество nvarchar(20),
Ученая_степень nvarchar(50),
Ученое_звание nvarchar(50),
Кафедра nvarchar(10) not null,
check (Ученая_степень in (null, 'Кандидат', 'Доктор')),
check (Ученое_звание in (null, 'Доцент', 'Профессор'))
);

create table Дисциплины (
ID int primary key identity not null,
Название nvarchar(50) not null,
ID_Специальности int references Специальности(ID) not null,
Семестр int not null,
Объем int not null,
Отчетность nvarchar(12) not null,
check (Отчетность in ('Экзамен', 'Зачёт', 'Курсовая', 'Контрольная'))
);

create table Изучение (
Номер_зачётной_книжки int references Студенты(Номер_зачётной_книжки) not null,
ID_Дисциплины int references Дисциплины(ID) not null,
Дата_сдачи date not null,
Оценка nvarchar(17) not null,
check (Оценка in ('Неявка', 'Неудовлетворительно', 'Удовлетворительно', 'Хорошо', 'Отлично', 'Зачёт', 'Незачёт'))
);

create table Преподавание (
ID_Дисциплины int references Дисциплины(ID) not null,
Табельный_номер int references Преподаватели(Табельный_номер) not null
);

insert Специальности 
    values ('09.03.01', 'ИВТ', 'Очная', 'Бакалавриат', 8, 'Информатика и вычисительная техника'),
		('09.04.01.01', 'ТРПО', 'Очная', 'Магистратура', 4, 'Технология разработки программного обеспечения'),
		('09.03.02', 'ИСИТ', 'Очная', 'Бакалавриат', 8, 'Информационные системы и технологии'),		
		('09.03.04', 'ПИ', 'Заочная', 'Бакалавриат', 10, 'Программная инженерия');

insert Группы 
    values ('КИ19-06Б', 1, 1, 1),	
		('КИ19-07М', 2, 8, 2),		
		('КИ19-08Б', 3, 15, 3),		
		('КИ19-09Б', 3, 22, 4);

insert Студенты 
	values

		--КИ19-06Б
		('Багринцев', 'Владимир', 'Сергеевич', 1, 2019),
		('Белоусов', 'Алексей', 'Дмитриевич', 1, 2019),
        ('Васильев', 'Александр', 'Сергеевич', 1, 2019),
        ('Гласс', 'Юрий', 'Игоревич', 1, 2019),
        ('Гуськов', 'Данила', 'Алексеевич', 1, 2019),
        ('Дедюхина', 'Анастасия', 'Юрьевна', 1, 2019),
        ('Желамский', 'Егор', 'Алексеевич', 1, 2019),

		--КИ19-07М
        ('Загвоскин', 'Владислав', 'Николаевич', 2, 2019),
        ('Золотарский', 'Егор', 'Викторович', 2, 2019),
        ('Иовенко', 'Богдан', 'Сергеевич', 2, 2019),
        ('Коряпин', 'Андрей', 'Алексеевич', 2, 2019),
        ('Куценко', 'Никита', 'Валерьевич', 2, 2019),
        ('Легков', 'Арсений', 'Алексеевич', 2, 2019),
        ('Логинов', 'Никита', 'Владимирович', 2, 2019),

		--КИ19-08Б
        ('Ляхова', 'Яна', 'Николаевна', 3, 2019),
        ('Малаева', 'Полина', 'Маратовна', 3, 2019),
        ('Маслов', 'Евгений', 'Александрович', 3, 2019),
        ('Мужайло', 'Алексей', 'Сергеевич', 3, 2019),
        ('Пономарёва', 'Александра', 'Олеговна', 3, 2019),
        ('Степанова', 'Ирина', 'Леонидовна', 3, 2019),
        ('Судьярова', 'Юлия', 'Вячеславовна', 3, 2019),

		--КИ19-09Б
        ('Алексеева', 'Вероника', 'Алексеевна', 4, 2019),
        ('Литвинцев', 'Антон', 'Дмитриевич', 4, 2019),
        ('Нестеров', 'Данил', 'Дмитриевич', 4, 2019),
        ('Торохов', 'Никита', 'Владимирович', 4, 2019),
        ('Черемных', 'Виктор', 'Дмитриевич', 4, 2019),
        ('Чубаков', 'Иван', 'Сергеевич', 4, 2019),
        ('Шнайдер', 'Александр', 'Владимирович', 4, 2019);

insert Преподаватели
	values ('Баянова', 'Екатерина', 'Александровна', 'Доктор', 'Профессор', 'ИВТ'),
		   ('Гульнова', 'Белла', 'Владимировна', 'Кандидат', 'Доцент', 'ТРПО'),
		   ('Киреева', 'Аида', 'Владимировна', 'Доктор', 'Доцент', 'ИСИТ'),
		   ('Хитева', 'Ольга', 'Александровна', null, 'Профессор', 'ПИ');
		
insert Дисциплины
	values

		--1 семестр

		--ИВТ
		('Алгебра и геометрия', 1, 1, 180, 'Экзамен'),
		('Информатика', 1, 1, 144, 'Экзамен'),
		('Информатика', 1, 1, 144, 'Зачёт'),
		('Введение в профессиональную деятельность', 1, 1, 144, 'Зачёт'),
		('Иностранный язык', 1, 1, 72, 'Зачёт'),					
		
		--ТРПО
		('Алгебра и геометрия', 2, 1, 180, 'Экзамен'),
		('Основы программирования', 2, 1, 144, 'Экзамен'),
		('Основы программирования', 2, 1, 144, 'Зачёт'),
		('Введение в профессиональную деятельность', 2, 1, 144, 'Зачёт'),
		('Иностранный язык', 2, 1, 72, 'Зачёт'),					

		--ИСИТ
		('Алгебра и геометрия', 3, 1, 180, 'Экзамен'),
		('Алгоритмы и структуры данных', 3, 1, 144, 'Экзамен'),
		('Алгоритмы и структуры данных', 3, 1, 144, 'Зачёт'),
		('Введение в профессиональную деятельность', 3, 1, 144, 'Зачёт'),
		('Иностранный язык', 3, 1, 72, 'Зачёт'),					

		--ПИ
		('Алгебра и геометрия', 4, 1, 180, 'Экзамен'),
		('Математический анализ', 4, 1, 144, 'Экзамен'),
		('Математический анализ', 4, 1, 144, 'Зачёт'),
		('Введение в профессиональную деятельность', 4, 1, 144, 'Зачёт'),
		('Иностранный язык', 4, 1, 72, 'Зачёт'),					

		--2 семестр

		--ИВТ
		('Введение в профессиональную деятельность', 1, 2, 180, 'Экзамен'),
		('Дискретная математика', 1, 2, 144, 'Экзамен'),
		('Дискретная математика', 1, 2, 144, 'Зачёт'),
		('Физика', 1, 2, 144, 'Зачёт'),
		('Физическая культура и спорт', 1, 2, 72, 'Зачёт'),
		
		--ТПРО
		('Введение в профессиональную деятельность', 1, 2, 180, 'Экзамен'),
		('Дискретная математика', 2, 2, 144, 'Экзамен'),
		('Дискретная математика', 2, 2, 144, 'Зачёт'),
		('Ознакомительная практика', 2, 2, 144, 'Зачёт'),
		('Физическая культура и спорт', 2, 2, 72, 'Зачёт'),

		--ИСИТ
		('Введение в профессиональную деятельность', 3, 2, 180, 'Экзамен'),
		('Дискретная математика', 3, 2, 144, 'Экзамен'),
		('Дискретная математика', 3, 2, 144, 'Зачёт'),
		('Всеобщая история', 3, 2, 144, 'Зачёт'),
		('Физическая культура и спорт', 3, 2, 72, 'Зачёт'),

		--ПИ
		('Введение в профессиональную деятельность', 4, 2, 180, 'Экзамен'),
		('Дискретная математика', 4, 2, 144, 'Экзамен'),
		('Дискретная математика', 4, 2, 144, 'Зачёт'),
		('Основы сетевых технологий', 4, 2, 144, 'Зачёт'),
		('Физическая культура и спорт', 4, 2, 72, 'Зачёт');

insert Изучение 
    values
		
		--1 семестр

		--КИ19-06Б
		(1, 1, '2019-12-29', 'Отлично'), 
		(2, 1, '2019-12-29', 'Отлично'),
		(3, 1, '2019-12-29', 'Хорошо'),
		(4, 1, '2019-12-29', 'Хорошо'),
		(5, 1, '2019-12-29', 'Хорошо'),
		(6, 1, '2019-12-29', 'Хорошо'),
		(7, 1, '2019-12-29', 'Удовлетворительно'),
		(1, 2, '2019-12-27', 'Хорошо'),
		(2, 2, '2019-12-27', 'Отлично'),
		(3, 2, '2019-12-27', 'Отлично'),
		(4, 2, '2019-12-27', 'Отлично'),
		(5, 2, '2019-12-27', 'Хорошо'),
		(6, 2, '2019-12-27', 'Удовлетворительно'),
		(7, 2, '2019-12-27', 'Удовлетворительно'),
		(1, 3, '2019-12-29', 'Зачёт'),
		(2, 3, '2019-12-29', 'Зачёт'),
		(3, 3, '2019-12-29', 'Зачёт'),
		(4, 3, '2019-12-29', 'Зачёт'),
		(5, 3, '2019-12-29', 'Зачёт'),
		(6, 3, '2019-12-29', 'Зачёт'),
		(7, 3, '2019-12-29', 'Зачёт'),
		(1, 4, '2019-12-29', 'Зачёт'),
		(2, 4, '2019-12-29', 'Зачёт'),
		(3, 4, '2019-12-29', 'Зачёт'),
		(4, 4, '2019-12-29', 'Зачёт'),
		(5, 4, '2019-12-29', 'Зачёт'),
		(6, 4, '2019-12-29', 'Зачёт'),
		(7, 4, '2019-12-29', 'Зачёт'),
		(1, 5, '2019-12-27', 'Зачёт'),
		(2, 5, '2019-12-27', 'Зачёт'),
		(3, 5, '2019-12-27', 'Зачёт'),
		(4, 5, '2019-12-27', 'Зачёт'),
		(5, 5, '2019-12-27', 'Зачёт'),
		(6, 5, '2019-12-27', 'Зачёт'),
		(7, 5, '2019-12-27', 'Зачёт'),

		--КИ19-07М
		(8, 6, '2019-12-29', 'Отлично'), 
		(9, 6, '2019-12-29', 'Удовлетворительно'),
		(10, 6, '2019-12-29', 'Хорошо'),
		(11, 6, '2019-12-29', 'Хорошо'),
		(12, 6, '2019-12-29', 'Отлично'),
		(13, 6, '2019-12-29', 'Хорошо'),
		(14, 6, '2019-12-29', 'Хорошо'),
		(8, 7, '2019-12-27', 'Отлично'),
		(9, 7, '2019-12-27', 'Хорошо'),
		(10, 7, '2019-12-27', 'Хорошо'),
		(11, 7, '2019-12-27', 'Отлично'),
		(12, 7, '2019-12-27', 'Удовлетворительно'),
		(13, 7, '2019-12-27', 'Хорошо'),
		(14, 7, '2019-12-27', 'Удовлетворительно'),
		(8, 8, '2019-12-29', 'Зачёт'),
		(9, 8, '2019-12-29', 'Зачёт'),
		(10, 8, '2019-12-29', 'Зачёт'),
		(11, 8, '2019-12-29', 'Зачёт'),
		(12, 8, '2019-12-29', 'Зачёт'),
		(13, 8, '2019-12-29', 'Зачёт'),
		(14, 8, '2019-12-29', 'Зачёт'),
		(8, 9, '2019-12-29', 'Зачёт'),
		(9, 9, '2019-12-29', 'Зачёт'),
		(10, 9, '2019-12-29', 'Зачёт'),
		(11, 9, '2019-12-29', 'Зачёт'),
		(12, 9, '2019-12-29', 'Зачёт'),
		(13, 9, '2019-12-29', 'Зачёт'),
		(14, 9, '2019-12-29', 'Зачёт'),
		(8, 10, '2019-12-27', 'Зачёт'),
		(9, 10, '2019-12-27', 'Зачёт'),
		(10, 10, '2019-12-27', 'Зачёт'),
		(11, 10, '2019-12-27', 'Зачёт'),
		(12, 10, '2019-12-27', 'Зачёт'),
		(13, 10, '2019-12-27', 'Зачёт'),
		(14, 10, '2019-12-27', 'Зачёт'),

		--КИ19-08Б
		(15, 11, '2019-12-29', 'Удовлетворительно'), 
		(16, 11, '2019-12-29', 'Отлично'),
		(17, 11, '2019-12-29', 'Хорошо'),
		(18, 11, '2019-12-29', 'Отлично'),
		(19, 11, '2019-12-29', 'Хорошо'),
		(20, 11, '2019-12-29', 'Удовлетворительно'),
		(21, 11, '2019-12-29', 'Хорошо'),
		(15, 12, '2019-12-27', 'Отлично'),
		(16, 12, '2019-12-27', 'Отлично'),
		(17, 12, '2019-12-27', 'Отлично'),
		(18, 12, '2019-12-27', 'Удовлетворительно'),
		(19, 12, '2019-12-27', 'Удовлетворительно'),
		(20, 12, '2019-12-27', 'Удовлетворительно'),
		(21, 12, '2019-12-27', 'Хорошо'),
		(15, 13, '2019-12-29', 'Зачёт'),
		(16, 13, '2019-12-29', 'Зачёт'),
		(17, 13, '2019-12-29', 'Зачёт'),
		(18, 13, '2019-12-29', 'Зачёт'),
		(19, 13, '2019-12-29', 'Зачёт'),
		(20, 13, '2019-12-29', 'Зачёт'),
		(21, 13, '2019-12-29', 'Зачёт'),
		(15, 14, '2019-12-29', 'Зачёт'),
		(16, 14, '2019-12-29', 'Зачёт'),
		(17, 14, '2019-12-29', 'Зачёт'),
		(18, 14, '2019-12-29', 'Зачёт'),
		(19, 14, '2019-12-29', 'Зачёт'),
		(20, 14, '2019-12-29', 'Зачёт'),
		(21, 14, '2019-12-29', 'Зачёт'),
		(15, 15, '2019-12-27', 'Зачёт'),
		(16, 15, '2019-12-27', 'Зачёт'),
		(17, 15, '2019-12-27', 'Зачёт'),
		(18, 15, '2019-12-27', 'Зачёт'),
		(19, 15, '2019-12-27', 'Зачёт'),
		(20, 15, '2019-12-27', 'Зачёт'),
		(21, 15, '2019-12-27', 'Зачёт'),

		--КИ19-09Б
		(22, 11, '2019-12-29', 'Удовлетворительно'), 
		(23, 11, '2019-12-29', 'Удовлетворительно'),
		(24, 11, '2019-12-29', 'Хорошо'),
		(25, 11, '2019-12-29', 'Отлично'),
		(26, 11, '2019-12-29', 'Хорошо'),
		(27, 11, '2019-12-29', 'Хорошо'),
		(28, 11, '2019-12-29', 'Удовлетворительно'),
		(22, 12, '2019-12-27', 'Хорошо'),
		(23, 12, '2019-12-27', 'Хорошо'),
		(24, 12, '2019-12-27', 'Отлично'),
		(25, 12, '2019-12-27', 'Отлично'),
		(26, 12, '2019-12-27', 'Отлично'),
		(27, 12, '2019-12-27', 'Удовлетворительно'),
		(28, 12, '2019-12-27', 'Отлично'),
		(22, 13, '2019-12-29', 'Зачёт'),
		(23, 13, '2019-12-29', 'Зачёт'),
		(24, 13, '2019-12-29', 'Зачёт'),
		(25, 13, '2019-12-29', 'Зачёт'),
		(26, 13, '2019-12-29', 'Зачёт'),
		(27, 13, '2019-12-29', 'Зачёт'),
		(28, 13, '2019-12-29', 'Зачёт'),
		(22, 14, '2019-12-29', 'Зачёт'),
		(23, 14, '2019-12-29', 'Зачёт'),
		(24, 14, '2019-12-29', 'Зачёт'),
		(25, 14, '2019-12-29', 'Зачёт'),
		(26, 14, '2019-12-29', 'Зачёт'),
		(27, 14, '2019-12-29', 'Зачёт'),
		(28, 14, '2019-12-29', 'Зачёт'),
		(22, 15, '2019-12-27', 'Зачёт'),
		(23, 15, '2019-12-27', 'Зачёт'),
		(24, 15, '2019-12-27', 'Зачёт'),
		(25, 15, '2019-12-27', 'Зачёт'),
		(26, 15, '2019-12-27', 'Зачёт'),
		(27, 15, '2019-12-27', 'Зачёт'),
		(28, 15, '2019-12-27', 'Зачёт'),

		--2 семестр

		--КИ19-06Б
		(1, 21, '2019-12-29', 'Удовлетворительно'), 
		(2, 21, '2019-12-29', 'Отлично'),
		(3, 21, '2019-12-29', 'Отлично'),
		(4, 21, '2019-12-29', 'Удовлетворительно'),
		(5, 21, '2019-12-29', 'Хорошо'),
		(6, 21, '2019-12-29', 'Хорошо'),
		(7, 21, '2019-12-29', 'Отлично'),
		(1, 22, '2019-12-27', 'Хорошо'),
		(2, 22, '2019-12-27', 'Отлично'),
		(3, 22, '2019-12-27', 'Отлично'),
		(4, 22, '2019-12-27', 'Хорошо'),
		(5, 22, '2019-12-27', 'Удовлетворительно'),
		(6, 22, '2019-12-27', 'Хорошо'),
		(7, 22, '2019-12-27', 'Хорошо'),
		(1, 23, '2019-12-29', 'Зачёт'),
		(2, 23, '2019-12-29', 'Зачёт'),
		(3, 23, '2019-12-29', 'Зачёт'),
		(4, 23, '2019-12-29', 'Зачёт'),
		(5, 23, '2019-12-29', 'Зачёт'),
		(6, 23, '2019-12-29', 'Зачёт'),
		(7, 23, '2019-12-29', 'Зачёт'),
		(1, 24, '2019-12-29', 'Зачёт'),
		(2, 24, '2019-12-29', 'Зачёт'),
		(3, 24, '2019-12-29', 'Зачёт'),
		(4, 24, '2019-12-29', 'Зачёт'),
		(5, 24, '2019-12-29', 'Зачёт'),
		(6, 24, '2019-12-29', 'Зачёт'),
		(7, 24, '2019-12-29', 'Зачёт'),
		(1, 25, '2019-12-27', 'Зачёт'),
		(2, 25, '2019-12-27', 'Зачёт'),
		(3, 25, '2019-12-27', 'Зачёт'),
		(4, 25, '2019-12-27', 'Зачёт'),
		(5, 25, '2019-12-27', 'Зачёт'),
		(6, 25, '2019-12-27', 'Зачёт'),
		(7, 25, '2019-12-27', 'Зачёт'),

		--КИ19-07М
		(8, 26, '2019-12-29', 'Отлично'), 
		(9, 26, '2019-12-29', 'Отлично'),
		(10, 26, '2019-12-29', 'Хорошо'),
		(11, 26, '2019-12-29', 'Удовлетворительно'),
		(12, 26, '2019-12-29', 'Отлично'),
		(13, 26, '2019-12-29', 'Хорошо'),
		(14, 26, '2019-12-29', 'Удовлетворительно'),
		(8, 27, '2019-12-27', 'Хорошо'),
		(9, 27, '2019-12-27', 'Хорошо'),
		(10, 27, '2019-12-27', 'Хорошо'),
		(11, 27, '2019-12-27', 'Удовлетворительно'),
		(12, 27, '2019-12-27', 'Хорошо'),
		(13, 27, '2019-12-27', 'Хорошо'),
		(14, 27, '2019-12-27', 'Хорошо'),
		(8, 28, '2019-12-29', 'Зачёт'),
		(9, 28, '2019-12-29', 'Зачёт'),
		(10, 28, '2019-12-29', 'Зачёт'),
		(11, 28, '2019-12-29', 'Зачёт'),
		(12, 28, '2019-12-29', 'Зачёт'),
		(13, 28, '2019-12-29', 'Зачёт'),
		(14, 28, '2019-12-29', 'Зачёт'),
		(8, 29, '2019-12-29', 'Зачёт'),
		(9, 29, '2019-12-29', 'Зачёт'),
		(10, 29, '2019-12-29', 'Зачёт'),
		(11, 29, '2019-12-29', 'Зачёт'),
		(12, 29, '2019-12-29', 'Зачёт'),
		(13, 29, '2019-12-29', 'Зачёт'),
		(14, 29, '2019-12-29', 'Зачёт'),
		(8, 30, '2019-12-27', 'Зачёт'),
		(9, 30, '2019-12-27', 'Зачёт'),
		(10, 30, '2019-12-27', 'Зачёт'),
		(11, 30, '2019-12-27', 'Зачёт'),
		(12, 30, '2019-12-27', 'Зачёт'),
		(13, 30, '2019-12-27', 'Зачёт'),
		(14, 30, '2019-12-27', 'Зачёт'),

		--КИ19-08Б
		(15, 31, '2019-12-29', 'Отлично'), 
		(16, 31, '2019-12-29', 'Отлично'),
		(17, 31, '2019-12-29', 'Хорошо'),
		(18, 31, '2019-12-29', 'Хорошо'),
		(19, 31, '2019-12-29', 'Хорошо'),
		(20, 31, '2019-12-29', 'Хорошо'),
		(21, 31, '2019-12-29', 'Отлично'),
		(15, 32, '2019-12-27', 'Хорошо'),
		(16, 32, '2019-12-27', 'Хорошо'),
		(17, 32, '2019-12-27', 'Отлично'),
		(18, 32, '2019-12-27', 'Хорошо'),
		(19, 32, '2019-12-27', 'Отлично'),
		(20, 32, '2019-12-27', 'Хорошо'),
		(21, 32, '2019-12-27', 'Отлично'),
		(15, 33, '2019-12-29', 'Зачёт'),
		(16, 33, '2019-12-29', 'Зачёт'),
		(17, 33, '2019-12-29', 'Зачёт'),
		(18, 33, '2019-12-29', 'Зачёт'),
		(19, 33, '2019-12-29', 'Зачёт'),
		(20, 33, '2019-12-29', 'Зачёт'),
		(21, 33, '2019-12-29', 'Зачёт'),
		(15, 34, '2019-12-29', 'Зачёт'),
		(16, 34, '2019-12-29', 'Зачёт'),
		(17, 34, '2019-12-29', 'Зачёт'),
		(18, 34, '2019-12-29', 'Зачёт'),
		(19, 34, '2019-12-29', 'Зачёт'),
		(20, 34, '2019-12-29', 'Зачёт'),
		(21, 34, '2019-12-29', 'Зачёт'),
		(15, 35, '2019-12-27', 'Зачёт'),
		(16, 35, '2019-12-27', 'Зачёт'),
		(17, 35, '2019-12-27', 'Зачёт'),
		(18, 35, '2019-12-27', 'Зачёт'),
		(19, 35, '2019-12-27', 'Зачёт'),
		(20, 35, '2019-12-27', 'Зачёт'),
		(21, 35, '2019-12-27', 'Зачёт'),

		--КИ19-09Б
		(22, 31, '2019-12-29', 'Отлично'), 
		(23, 31, '2019-12-29', 'Отлично'),
		(24, 31, '2019-12-29', 'Хорошо'),
		(25, 31, '2019-12-29', 'Хорошо'),
		(26, 31, '2019-12-29', 'Хорошо'),
		(27, 31, '2019-12-29', 'Удовлетворительно'),
		(28, 31, '2019-12-29', 'Хорошо'),
		(22, 32, '2019-12-27', 'Отлично'),
		(23, 32, '2019-12-27', 'Хорошо'),
		(24, 32, '2019-12-27', 'Хорошо'),
		(25, 32, '2019-12-27', 'Хорошо'),
		(26, 32, '2019-12-27', 'Хорошо'),
		(27, 32, '2019-12-27', 'Хорошо'),
		(28, 32, '2019-12-27', 'Отлично'),
		(22, 33, '2019-12-29', 'Зачёт'),
		(23, 33, '2019-12-29', 'Зачёт'),
		(24, 33, '2019-12-29', 'Зачёт'),
		(25, 33, '2019-12-29', 'Зачёт'),
		(26, 33, '2019-12-29', 'Зачёт'),
		(27, 33, '2019-12-29', 'Зачёт'),
		(28, 33, '2019-12-29', 'Зачёт'),
		(22, 34, '2019-12-29', 'Зачёт'),
		(23, 34, '2019-12-29', 'Зачёт'),
		(24, 34, '2019-12-29', 'Зачёт'),
		(25, 34, '2019-12-29', 'Зачёт'),
		(26, 34, '2019-12-29', 'Зачёт'),
		(27, 34, '2019-12-29', 'Зачёт'),
		(28, 34, '2019-12-29', 'Зачёт'),
		(22, 35, '2019-12-27', 'Зачёт'),
		(23, 35, '2019-12-27', 'Зачёт'),
		(24, 35, '2019-12-27', 'Зачёт'),
		(25, 35, '2019-12-27', 'Зачёт'),
		(26, 35, '2019-12-27', 'Зачёт'),
		(27, 35, '2019-12-27', 'Зачёт'),
		(28, 35, '2019-12-27', 'Зачёт');

insert Преподавание
	values (1, 1),
		   (2, 2),
		   (3, 3),
		   (4, 4),
		   (5, 2),
		   (6, 3),
		   (7, 4),
		   (8, 1),
		   (9, 3),
		   (10, 4),
		   (11, 1),
		   (12, 2),
		   (13, 4),
		   (14, 1),
		   (15, 2),
		   (16, 3),
		   (17, 1),
		   (18, 2),
		   (19, 3),
		   (20, 4),
		   (21, 2),
		   (22, 3),
		   (23, 4),
		   (24, 1),
		   (25, 3),
		   (26, 4),
		   (27, 1),
		   (28, 2),
		   (29, 4),
		   (30, 1),
		   (31, 2),
		   (32, 3),
		   (33, 1),
		   (34, 2),
		   (35, 3),
		   (36, 4),
		   (37, 2),
		   (38, 3),
		   (39, 4),
		   (40, 1);

go