select distinct Товар.Наименование as Товар, Поставщик.Наименование as Поставщик
	from Товар join Склад on Товар.ID = Склад.ID_Товара 
		join Поставщик on Склад.ID_Поставщика = Поставщик.ID;
select distinct Товар.Наименование as Товар, Поставщик.Наименование as Поставщик, Склад.Количество as Количество 
	from Товар left join Склад on Товар.ID = Склад.ID_Товара
		left join Поставщик on Склад.ID_Поставщика = Поставщик.ID;
select Товар.Наименование as Товар, isnull(Клиент.Имя, 'не определен') as Покупатель, isnull(cast(Сделка.Количество as nvarchar), 'нет продаж') as Количество
	from Сделка join Клиент on Сделка.ID_Клиента = Клиент.ID 
		right join Склад on Сделка.ID_Склада = Склад.ID
		join Товар on Склад.ID_Товара = Товар.ID;
select distinct Наименование
	from Поставщик join Склад on Поставщик.ID = Склад.ID_Поставщика;
select t1.Имя as Сотрудник, isnull(t2.Имя, 'не определен') as Начальник
	from Сотрудник as t1 left join Сотрудник as t2 on t1.ID_Руководителя = t2.ID;